StructuralMaterialType Property
 The family's structural material type.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public StructuralMaterialType StructuralMaterialType { get; }
  Visual Basic
Public ReadOnly Property StructuralMaterialType As StructuralMaterialType
	Get
  Visual C++
public:
property StructuralMaterialType StructuralMaterialType {
	StructuralMaterialType get ();
}
 See Also
  Family Class
  Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →